Revit 2022 API
ElectricalSystemSet.Clear Method
Removes every item from the set, rendering it empty.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public virtual void Clear()
Visual Basic
Public Overridable Sub Clear
Visual C++
public:
virtual void Clear()
See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace